Revit 2026 API

# TableData Methods

---

The TableData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSectionData(Int32) | Returns the section data array element at the specified index. |
|  | GetSectionData(SectionType) | Returns the pointer to the section data array element at the specified section type. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Checks if this element is equal in value to the other element. |
|  | IsValidZoomLevel | Verifies if the value of zoom level is valid. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

TableData Class

Autodesk.Revit.DB Namespace